node {
  name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
  op: "_Arg"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size:-1 
          }
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        tensor_content: "\"\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_1"
  op: "FloorMod"
  input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_1"
  op: "FloorDiv"
  input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1"
  op: "Sub"
  input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        tensor_content: "!\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_2"
  op: "FloorMod"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_2"
  op: "FloorDiv"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum"
  op: "Maximum"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_1"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_2"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Less"
  op: "Less"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Cast"
  op: "Cast"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Select"
  op: "Select"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Less"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_1"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_2"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_cast_0_retval_RetVal"
  op: "_Retval"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Cast"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
node {
  name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_select_0_retval_RetVal"
  op: "_Retval"
  input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Select"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "index"
    value {
      i: 1
    }
  }
}
library {
  function {
    signature {
      name: "cluster_21"
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
        type: DT_INT64
      }
      output_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_cast_0_retval"
        type: DT_INT32
      }
      output_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_select_0_retval"
        type: DT_INT64
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_1"
      op: "FloorMod"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_1"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_1"
      op: "FloorDiv"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_1"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1"
      op: "Sub"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_unique_0_arg"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_2"
      op: "FloorMod"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_2"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_2"
      op: "FloorDiv"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/sub_1:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_2"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum"
      op: "Maximum"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_1:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv_2:z:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Less"
      op: "Less"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Less"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Cast"
      op: "Cast"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Maximum:z:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "DstT"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "SrcT"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Truncate"
        value {
          b: false
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Cast"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Select"
      op: "Select"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Less:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_1:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod_2:z:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Select"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_260"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            tensor_content: "\"\000\000\000\000\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/add_1/clone_261"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_262"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            tensor_content: "\001\000\000\000\000\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_272"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_267"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT64
            tensor_shape {
            }
            tensor_content: "!\000\000\000\000\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/floordiv/clone_268"
      }
    }
    ret {
      key: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_cast_0_retval"
      value: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Cast:y:0"
    }
    ret {
      key: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_select_0_retval"
      value: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/Select:output:0"
    }
  }
  function {
    signature {
      name: "cluster_13"
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_axis_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_1_axis_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_2_axis_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_1_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_2_arg"
        type: DT_INT32
      }
      input_arg {
        name: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_0_read_0_arg"
        type: DT_FLOAT
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_0_arg"
        type: DT_INT64
      }
      input_arg {
        name: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_1_read_0_arg"
        type: DT_FLOAT
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_arg"
        type: DT_INT64
      }
      input_arg {
        name: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_2_read_0_arg"
        type: DT_FLOAT
      }
      input_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_2_arg"
        type: DT_INT64
      }
      output_arg {
        name: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_0_retval"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2"
      op: "GatherV2"
      input: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_0_read_0_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_0_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_axis_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Taxis"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tindices"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tparams"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "batch_dims"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_1"
      op: "GatherV2"
      input: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_1_read_0_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_1_axis_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Taxis"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tindices"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tparams"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "batch_dims"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_1"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_2"
      op: "GatherV2"
      input: "inputs_item_seq_cate_id_item_seq_cate_id_shared_embedding_cate_id_part_2_read_0_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_2_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_gatherv2_2_axis_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Taxis"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tindices"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tparams"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "batch_dims"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_2"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup"
      op: "ParallelDynamicStitch"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_0_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_1_arg"
      input: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_dynamicpartition_1_2_arg"
      input: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2:output:0"
      input: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_1:output:0"
      input: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/GatherV2_2:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "N"
        value {
          i: 3
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup"
      }
    }
    ret {
      key: "mind_inputs_item_seq_cate_id_1_item_seq_cate_id_shared_embedding_item_seq_cate_id_shared_embeddingweights_embedding_lookup_sparse_embedding_lookup_0_retval"
      value: "MIND/inputs/item_seq_cate_id_1/item_seq_cate_id_shared_embedding/item_seq_cate_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup:merged:0"
    }
  }
  function {
    signature {
      name: "cluster_20"
      input_arg {
        name: "constantfolding_input_fn_decodecsv_record_defaults_1_const_axis_clone_239_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_240_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_241_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_248_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_innerflatten_sparsereshape_1_arg"
        type: DT_INT64
      }
      output_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_cast_x_0_retval"
        type: DT_INT64
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/GatherV2"
      op: "GatherV2"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_innerflatten_sparsereshape_1_arg"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/stack/0/clone_238:output:0"
      input: "constantfolding_input_fn_decodecsv_record_defaults_1_const_axis_clone_239_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Taxis"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tindices"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tparams"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "batch_dims"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/GatherV2"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Slice"
      op: "Slice"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_innerflatten_sparsereshape_1_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_240_0_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_241_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Slice"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Prod"
      op: "Prod"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Slice:output:0"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_248_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tidx"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "keep_dims"
        value {
          b: false
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Prod"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Cast/x"
      op: "Pack"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Prod:output:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/GatherV2:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "N"
        value {
          i: 2
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Cast/x"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/stack/0/clone_238"
      op: "Const"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/stack/0/clone_238"
      }
    }
    ret {
      key: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_cast_x_0_retval"
      value: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/Cast/x:output:0"
    }
  }
  function {
    signature {
      name: "cluster_18"
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_214_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_strided_slice_stack_1_clone_215_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_216_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_217_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_218_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_219_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_231_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "constantfolding_input_fn_decodecsv_record_defaults_1_const_axis_clone_236_0_arg"
        type: DT_INT32
      }
      input_arg {
        name: "mind_inputs_sparseconcat_2_arg"
        type: DT_INT64
      }
      output_arg {
        name: "mind_inputs_sparsetensor_19_dense_shape_0_retval"
        type: DT_INT64
      }
      output_arg {
        name: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_innerflatten_concat_0_retval"
        type: DT_INT64
      }
    }
    node_def {
      name: "MIND/inputs/strided_slice_17"
      op: "StridedSlice"
      input: "mind_inputs_sparseconcat_2_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_214_0_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_strided_slice_stack_1_clone_215_0_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_216_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/strided_slice_17"
      }
    }
    node_def {
      name: "MIND/inputs/strided_slice_16"
      op: "StridedSlice"
      input: "mind_inputs_sparseconcat_2_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_begin_clone_217_0_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_218_0_arg"
      input: "mind_inputs_item_seq_item_id_1_item_seq_item_id_shared_embedding_item_seq_item_id_shared_embeddingweights_slice_1_size_clone_219_0_arg"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/strided_slice_16"
      }
    }
    node_def {
      name: "MIND/inputs/Maximum"
      op: "Maximum"
      input: "MIND/inputs/strided_slice_17:output:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/item_seq_item_id_shared_embeddingweights/embedding_lookup_sparse/embedding_lookup/mod/clone_226:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/Maximum"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"
      op: "Const"
      input: "^MIND/inputs/strided_slice_16"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            int_val: 0
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice_1"
      op: "Const"
      input: "^MIND/inputs/Maximum"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            int_val: 0
          }
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice_1"
      }
    }
    node_def {
      name: "MIND/inputs/SparseTensor_19/dense_shape"
      op: "Pack"
      input: "MIND/inputs/strided_slice_16:output:0"
      input: "MIND/inputs/Maximum:z:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "N"
        value {
          i: 2
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/SparseTensor_19/dense_shape"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice"
      op: "ExpandDims"
      input: "MIND/inputs/strided_slice_16:output:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tdim"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice_1"
      op: "ExpandDims"
      input: "MIND/inputs/Maximum:z:0"
      input: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_Axis_strided_slice_1:output:0"
      device: "/job:localhost/replica:0/task:0/device:CPU:0"
      attr {
        key: "T"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "Tdim"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "_XlaAlreadyClustered"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/ArithmeticOptimizer/RemoveStackStridedSliceSameAxis_strided_slice_1"
      }
    }
    node_def {
      name: "MIND/inputs/item_seq_item_id_1/item_seq_item_id_shared_embedding/InnerFlatten/Prod"
      op: "Prod"
